exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/api_sendTriggeredEmail_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <fueloauth xmlns="http://exacttarget.com">%s(accessToken)</fueloauth>
   </soapenv:Header>
   <soapenv:Body>
      <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
         <Options>
            <CallsInConversation>1</CallsInConversation>
            <ConversationID>%s(apiSendTriggeredEmailConversationID)</ConversationID>
            <RequestType>Asynchronous</RequestType>
            <SequenceCode>1</SequenceCode>
         </Options>
         <Objects xsi:type="TriggeredSend" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI">
            <TriggeredSendDefinition>
               <CustomerKey>%s(triggeredSendDefinitionCustomerKey)</CustomerKey>
            </TriggeredSendDefinition>
            <Subscribers>
               <SubscriberKey>%s(subscriberKey)</SubscriberKey>
               <EmailAddress>%s(email)</EmailAddress>
            </Subscribers>
         </Objects>
      </CreateRequest>
   </soapenv:Body>
</soapenv:Envelope>